#**************************************************************
# This .sbc file is created by Terasic Tool.
# Users are recommended to modify this file to match users logic.
#**************************************************************

#**************************************************************
# Create Clock
#**************************************************************
create_clock -period 20 [get_ports CLOCK_50]
create_clock -period 20 [get_ports CLOCK2_50]
create_clock -period 20 [get_ports CLOCK3_50]


#**************************************************************
# Create Generated Clock
#**************************************************************
derive_pll_clocks



#**************************************************************
# Set Clock Latency
#**************************************************************



#**************************************************************
# Set Clock Uncertainty
#**************************************************************
derive_clock_uncertainty



#**************************************************************
# Set Input Delay
#**************************************************************
set_input_delay -clock CLOCK_50 -clock_fall 8 [get_ports {KEY*}]
#set_input_delay -clock altera_reserved_tck -clock_fall 8 [get_ports {altera_reserved_*}]


#**************************************************************
# Set Output Delay
#**************************************************************
set_output_delay -clock CLOCK_50 7 [get_ports {HEX*}]
set_output_delay -clock CLOCK_50 7 [get_ports {LCD_*}]
set_output_delay -clock CLOCK_50 7 [get_ports {LED*}]
#set_output_delay -clock altera_reserved_tck -clock_fall 8 [get_ports {altera_reserved_*}]



#**************************************************************
# Set Clock Groups
#**************************************************************



#**************************************************************
# Set False Path
#**************************************************************



#**************************************************************
# Set Multicycle Path
#**************************************************************



#**************************************************************
# Set Maximum Delay
#**************************************************************



#**************************************************************
# Set Minimum Delay
#**************************************************************



#**************************************************************
# Set Input Transition
#**************************************************************



#**************************************************************
# Set Load
#**************************************************************



